In [1]:
%load_ext sql

In [2]:
%sql sqlite:///cssys.db

'Connected: @cssys.db'

In [3]:
%%sql

CREATE TABLE students (ID int, firstname char(15), lastname char(15), age int, gender char(1), gpa double, PRIMARY KEY (ID))

 * sqlite:///cssys.db
Done.

[]

In [4]:
%%sql

CREATE TABLE courses (Id int, name varchar(30), credit int, prereq int, PRIMARY KEY (Id, prereq))

 * sqlite:///cssys.db
Done.

[]

In [5]:
%%sql 

CREATE TABLE transcript (studentid int, courseid int, mark double, semester int, credit int, PRIMARY KEY (studentid, courseid))

 * sqlite:///cssys.db
Done.

[]

In [6]:
%%sql
DROP TABLE students;

 * sqlite:///cssys.db
Done.

[]

In [7]:
%%sql

CREATE TABLE students (ID int, firstname char(15), lastname char(15), dob char(10), gender char(1), gpa double, PRIMARY KEY (ID))

 * sqlite:///cssys.db
Done.

[]

In [8]:
%%sql 

INSERT INTO students VALUES (1001, 'adam', 'smith', '2000-01-03', 'm', 3.1);
INSERT INTO students VALUES (1002, 'alice', 'frank', '1999-03-11', 'f', 3.4);
INSERT INTO students VALUES (1003, 'bob', 'hal', '1999-09-01', 'm', 2.0);

 * sqlite:///cssys.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql
SELECT * FROM students

 * sqlite:///cssys.db
Done.

[(1001, 'adam', 'smith', '2000-01-03', 'm', 3.1),
 (1002, 'alice', 'frank', '1999-03-11', 'f', 3.4),
 (1003, 'bob', 'hal', '1999-09-01', 'm', 2.0)]

In [10]:
%%sql

INSERT INTO courses VALUES(100, 'programming', 3, NULL);
INSERT INTO courses VALUES(110, 'math', 3, NULL);
INSERT INTO courses VALUES(120, 'web', 4, NULL);
INSERT INTO courses VALUES(301, 'networking', 4, 200);
INSERT INTO courses VALUES(301, 'networking', 4, 150);
INSERT INTO courses VALUES(301, 'networking', 4, 210);
INSERT INTO courses VALUES(354, 'database', 3, 120);
INSERT INTO courses VALUES(354, 'database', 3, 110);
INSERT INTO courses VALUES(360, 'os', 3, 150);
INSERT INTO courses VALUES(360, 'os', 3, 210);

 * sqlite:///cssys.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
SELECT * FROM courses

 * sqlite:///cssys.db
Done.

[(100, 'programming', 3, None),
 (110, 'math', 3, None),
 (120, 'web', 4, None),
 (301, 'networking', 4, 200),
 (301, 'networking', 4, 150),
 (301, 'networking', 4, 210),
 (354, 'database', 3, 120),
 (354, 'database', 3, 110),
 (360, 'os', 3, 150),
 (360, 'os', 3, 210)]

In [12]:
%%sql

INSERT INTO transcript VALUES (1001, 100, 3.0, 201801, 3);
INSERT INTO transcript VALUES (1001, 110, 3.5, 201801, 3);
INSERT INTO transcript VALUES (1001, 120, 2.7, 201801, 4);
INSERT INTO transcript VALUES (1001, 301, 3.4, 201802, 4);
INSERT INTO transcript VALUES (1002, 100, 3.0, 201801, 3);
INSERT INTO transcript VALUES (1002, 110, 3.2, 201901, 3);
INSERT INTO transcript VALUES (1002, 301, 3.1, 201902, 4);
INSERT INTO transcript VALUES (1003, 100, 2.5, 201801, 3);
INSERT INTO transcript VALUES (1003, 120, 3.5, 201901, 4);
INSERT INTO transcript VALUES (1003, 301, 2.8, 201902, 4);
INSERT INTO transcript VALUES (1003, 354, 4.0, 201903, 3);
INSERT INTO transcript VALUES (1003, 360, 3.5, 201802, 3);

 * sqlite:///cssys.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%%sql
SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0, 201801, 3),
 (1001, 110, 3.5, 201801, 3),
 (1001, 120, 2.7, 201801, 4),
 (1001, 301, 3.4, 201802, 4),
 (1002, 100, 3.0, 201801, 3),
 (1002, 110, 3.2, 201901, 3),
 (1002, 301, 3.1, 201902, 4),
 (1003, 100, 2.5, 201801, 3),
 (1003, 120, 3.5, 201901, 4),
 (1003, 301, 2.8, 201902, 4),
 (1003, 354, 4.0, 201903, 3),
 (1003, 360, 3.5, 201802, 3)]

In [14]:
%%sql 
SELECT * FROM students

 * sqlite:///cssys.db
Done.

[(1001, 'adam', 'smith', '2000-01-03', 'm', 3.1),
 (1002, 'alice', 'frank', '1999-03-11', 'f', 3.4),
 (1003, 'bob', 'hal', '1999-09-01', 'm', 2.0)]

In [15]:
%%sql
SELECT * FROM courses
where credit = 3

 * sqlite:///cssys.db
Done.

[(100, 'programming', 3, None),
 (110, 'math', 3, None),
 (354, 'database', 3, 120),
 (354, 'database', 3, 110),
 (360, 'os', 3, 150),
 (360, 'os', 3, 210)]

In [16]:
%%sql 
SELECT*FROM transcript
WHERE mark > 3 AND credit >= 3

 * sqlite:///cssys.db
Done.

[(1001, 110, 3.5, 201801, 3),
 (1001, 301, 3.4, 201802, 4),
 (1002, 110, 3.2, 201901, 3),
 (1002, 301, 3.1, 201902, 4),
 (1003, 120, 3.5, 201901, 4),
 (1003, 354, 4.0, 201903, 3),
 (1003, 360, 3.5, 201802, 3)]

In [17]:
%%sql
SELECT studentid, courseid, mark
FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0),
 (1001, 110, 3.5),
 (1001, 120, 2.7),
 (1001, 301, 3.4),
 (1002, 100, 3.0),
 (1002, 110, 3.2),
 (1002, 301, 3.1),
 (1003, 100, 2.5),
 (1003, 120, 3.5),
 (1003, 301, 2.8),
 (1003, 354, 4.0),
 (1003, 360, 3.5)]

In [18]:
%%sql
SELECT studentid, courseid, mark, semester
FROM transcript
WHERE semester = 201902

 * sqlite:///cssys.db
Done.

[(1002, 301, 3.1, 201902), (1003, 301, 2.8, 201902)]

In [19]:
%%sql
SELECT DISTINCT courseid FROM transcript

 * sqlite:///cssys.db
Done.

[(100,), (110,), (120,), (301,), (354,), (360,)]

In [20]:
%%sql
SELECT firstname, lastname, gpa
FROM students
ORDER BY gpa DESC

 * sqlite:///cssys.db
Done.

[('alice', 'frank', 3.4), ('adam', 'smith', 3.1), ('bob', 'hal', 2.0)]

In [21]:
%%sql

ALTER TABLE transcript ADD lettergrade char(1);

 * sqlite:///cssys.db
Done.

[]

In [22]:
%%sql
SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0, 201801, 3, None),
 (1001, 110, 3.5, 201801, 3, None),
 (1001, 120, 2.7, 201801, 4, None),
 (1001, 301, 3.4, 201802, 4, None),
 (1002, 100, 3.0, 201801, 3, None),
 (1002, 110, 3.2, 201901, 3, None),
 (1002, 301, 3.1, 201902, 4, None),
 (1003, 100, 2.5, 201801, 3, None),
 (1003, 120, 3.5, 201901, 4, None),
 (1003, 301, 2.8, 201902, 4, None),
 (1003, 354, 4.0, 201903, 3, None),
 (1003, 360, 3.5, 201802, 3, None)]

In [23]:
%%sql

UPDATE transcript
SET lettergrade = 'A'
WHERE mark >= 3.5

 * sqlite:///cssys.db
4 rows affected.

[]

In [24]:
%%sql

UPDATE transcript
SET lettergrade = 'B'
WHERE mark >=3 AND mark < 3.5

 * sqlite:///cssys.db
5 rows affected.

[]

In [25]:
%%sql
UPDATE transcript
SET lettergrade = 'C'
WHERE mark >= 2.5 AND mark < 3

 * sqlite:///cssys.db
3 rows affected.

[]

In [26]:
%%sql
UPDATE transcript
SET lettergrade = 'D'
WHERE mark >= 2 AND mark <2.5

 * sqlite:///cssys.db
0 rows affected.

[]

In [27]:
%%sql
UPDATE transcript
SET lettergrade = 'F'
WHERE mark < 2

 * sqlite:///cssys.db
0 rows affected.

[]

In [28]:
%%sql
SELECT * FROM transcript

 * sqlite:///cssys.db
Done.

[(1001, 100, 3.0, 201801, 3, 'B'),
 (1001, 110, 3.5, 201801, 3, 'A'),
 (1001, 120, 2.7, 201801, 4, 'C'),
 (1001, 301, 3.4, 201802, 4, 'B'),
 (1002, 100, 3.0, 201801, 3, 'B'),
 (1002, 110, 3.2, 201901, 3, 'B'),
 (1002, 301, 3.1, 201902, 4, 'B'),
 (1003, 100, 2.5, 201801, 3, 'C'),
 (1003, 120, 3.5, 201901, 4, 'A'),
 (1003, 301, 2.8, 201902, 4, 'C'),
 (1003, 354, 4.0, 201903, 3, 'A'),
 (1003, 360, 3.5, 201802, 3, 'A')]